Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: Sync passwords across devices
ug: ئىمنى ئۈسكۈنىلەر ئارا قەدەمداشلايدۇ

source: Sync passwords, tabs, and more
ug: ئىم، بەتكۈچ ۋە باشقىلارنى قەدەمداشلايدۇ

source: Sync your tabs between devices, manage downloads, get tips about making the most of %s’s privacy protection, and more.
ug: بەتكۈچلىرىڭىزنى ئۈسكۈنىلەر ئارا قەدەمداشلايدۇ، چۈشۈرۈشنى باشقۇرىدۇ، %s نىڭ شەخسىيەت قوغدىشى ۋە باشقا تېخىمۇ كۆپ ئىشلىتىش ھەققىدىكى تەكلىپلەرگە ئېرىشتۈرىدۇ.

source: Tab closed
ug: بەتكۈچ تاقالدى

source: Tab count
ug: بەتكۈچ سانى

source: Tab creation tool
ug: بەتكۈچ قۇرۇش قورالى

source: Tab from %s
ug: %s بەتكۈچى

source: Tab quantity to create
ug: قۇرىدىغان بەتكۈچ سانى

source: Tab Received
ug: بەتكۈچ تاپشۇرۇۋالدى

source: Tabs
ug: بەتكۈچ

source: Tab saved!
ug: بەتكۈچ ساقلاندى!

source: Tabs closed
ug: بەتكۈچ تاقالدى

source: Tabs closed: %1$s
ug: بەتكۈچ تاقالدى: %1$s

source: Tab sent!
ug: بەتكۈچ يوللاندى!

source: Tab settings
ug: بەتكۈچ تەڭشىكى

source: Tabs Open: %1$s. Tap to switch tabs.
ug: %1$s بەتكۈچ ئوچۇق. چېكىلسە بەتكۈچ ئالمىشىدۇ.

source: Tabs saved!
ug: بەتكۈچ ساقلاندى!

source: Tabs sent!
ug: بەتكۈچ يوللاندى!

source: Tabs you haven’t viewed for two weeks get moved here.
ug: ئىككى ھەپتە كۆرمىگەن بەتكۈچلەر بۇ جايغا يۆتكىلىدۇ.

source: Tabs you haven’t viewed for two weeks get moved to the inactive section.
ug: سىز ئىككى ھەپتە كۆرمىگەن بەتكۈچلەر ئاكتىپسىز بۆلەككە يۆتكىلىدۇ.

source: Tab Tools
ug: بەتكۈچ قوراللىرى

source: Tab view
ug: بەتكۈچ كۆرۈنۈش

source: Take Survey
ug: تەكشۈرۈشكە قاتنىشىڭ

source: Tap and hold the arrows to jump between pages in this tab’s history.
ug: يا ئوقنى چېكىپ بېسىپ تۇرۇلسا بۇ بەتكۈچنىڭ تارىخىدىكى بەتلىرى ئارىسىدا ئاتلايدۇ.

source: Tap here to start a fresh private session. Delete your history, cookies — everything.
ug: بۇ جاي چېكىلسە يېڭى شەخسىي سۆزلەشكۈنى باشلايدۇ. تارىخ، cookies-دەك ھەممە ئۇچۇرلىرىڭىزنى ئۆچۈرىدۇ.

source: Tap or swipe this notification to close private tabs.
ug: بۇ ئۇقتۇرۇش چېكىلسە ياكى سۈرۈلسە شەخسىي بەتكۈچ تاقىلىدۇ.

source: Tap to copy the URL for this app
ug: چېكىلسە ئەپنىڭ تور ئادرېسىنى كۆچۈرىدۇ

source: Tap to open the tab that’s using your camera.
ug: چېكىلسە كامېرانى ئىشلىتىۋاتقان بەتكۈچنى ئاچىدۇ.

source: Tap to open the tab that’s using your microphone.
ug: چېكىلسە مىكروفوننى ئىشلىتىۋاتقان بەتكۈچنى ئاچىدۇ.

source: Tap to open the tab that’s using your microphone and camera.
ug: چېكىلسە مىكروفون ۋە كامېرانى ئىشلىتىۋاتقان بەتكۈچنى ئاچىدۇ.

source: Technical and interaction data
ug: تېخنىكىلىق ۋە تەسىرلىشىش سانلىق مەلۇماتى

source: Tell websites not to share & sell data
ug: تور بېكەتلەرگە ئۇچۇرلىرىڭىزنى تارقاتماسلىق ۋە ساتماسلىقنى ئېيتىڭ

source: Temporarily disabled
ug: ۋاقىتلىق چەكلەنگەن

source: terms of use
ug: ئىشلىتىش شەرتلىرى

source: Terms of use
ug: ئىشلىتىش شەرتلىرى

source: Text field is empty
ug: تېكىست بۆلىكى بوش

source: Thanks for reporting!
ug: دوكلات قىلغانلىقىڭىزغا رەھمەت!

source: Thanks for your feedback!
ug: قايتۇرما ئىنكاسىڭىزغا رەھمەت!

source: The address isn’t valid
ug: ئادرېس ئىناۋەتسىز

source: The application will quit to apply changes
ug: ئۆزگەرتىشلەرنى قوللىنىش ئۈچۈن ئەپتىن چېكىنىدۇ

source: The <b>adjusted rating</b> is based only on reviews we believe to be reliable.
ug: <b>تەڭشەلگەن باھا</b> پەقەت بىز ئىشەنچلىك دەپ قارىغان باھالارنىلا ئاساس قىلىدۇ.

source: The connection has timed out
ug: ۋاقتىدا ئۇلىنالمىدى

source: The connection was interrupted
ug: ئۇلىنىش ئۈزۈلۈپ قالدى

source: The connection was reset
ug: ئۇلىنىش ئەسلىگە كەلتۈرۈلدى

source: The editable text field for the password.
ug: ئىمنىڭ تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The editable text field for the password of the login.
ug: كىرىشنىڭ ئىمىنى تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The editable text field for the username.
ug: ئىشلەتكۈچى ئاتىنىڭ تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The editable text field for the username of the login.
ug: كىرىشنىڭ ئىشلەتكۈچى ئىسمىنى تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The editable text field for the username of the password.
ug: ئىمنىڭ ئىشلەتكۈچى ئىسمىدىكى تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The editable text field for the web address of the login.
ug: كىرىشنىڭ تور ئادرېسىنى تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The editable text field for the website address.
ug: تور بېكەت ئادرېسىنىڭ تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The editable text field for the website address of the password.
ug: ئىمنىڭ تور بېكەت ئادرېسىدىكى تەھرىرلىگىلى بولىدىغان تېكىست بۆلىكى.

source: The Independent Voices collection.
ug: مۇستەقىل ئاۋاز توپلىمى.

source: The Independent Voices collection. %s
ug: مۇستەقىل ئاۋاز توپلىمى. %s

source: The logins you save or sync to %s will show up here.
ug: سىز ساقلىغان كىرىش ياكى %s بىلەن بولغان قەدەمداش بۇ جايدا كۆرۈنىدۇ.

source: Theme
ug: ئۇسلۇب

source: The page at %1$s says:
ug: بەت %1$s تە دېيىلگىنى:

source: The page isn’t redirecting properly
ug: بۇ بەت توغرا قايتا نىشانلىيالمىدى

source: The passwords you save or sync to %s will be listed here. All passwords you save are encrypted.
ug: سىز ساقلىغان ياكى %s غا قەدەمداشلىغان ئىم بۇ يەردە كۆرسىتىلىدۇ. سىز ساقلىغان بارلىق ئىم مەخپىيلەشتۈرۈلگەن.

source: There was a problem translating. Please try again.
ug: تەرجىمە قىلىشتا مەسىلە كۆرۈلدى. قايتا سىناڭ.

source: The tab counter toolbar button.
ug: بەتكۈچ سانىغۇچ قورال بالداق توپچىسى.

source: This add-on could not be downloaded because of a connection failure.
ug: باغلىنالمىغانلىق سەۋەبىدىن بۇ قوشۇلمىنى چۈشۈرەلمەيدۇ.

source: This add-on could not be installed because it appears to be corrupt.
ug: بۇ قوشۇلمىنى ئورنىتالمايدۇ چۈنكى ئۇ بۇزۇلغاندەك تۇرىدۇ.

source: This add-on could not be installed because it has not been verified.
ug: بۇ قوشۇلمىنى ئورنىتالمايدۇ چۈنكى ئۇ دەلىللەنمىگەن.

source: This add-on was migrated from a previous version of %1$s
ug: بۇ قوشۇلما %1$s نىڭ ئالدىنقى نەشرىدىن كۆچۈرۈلگەن

source: This bar tucks away as you scroll down for extra browsing space.
ug: بەتنى دومىلاتقىنىڭىزدا بۇ بالداق ئۆزلۈكىدىن يوشۇرۇلۇپ كۆز يۈگۈرتۈشكە تېخىمۇ كۆپ بوشلۇق ئاجرىتىدۇ.

source: This could take about 60 seconds.
ug: بۇنىڭغا 60 سېكۇنت ئەتراپىدا ۋاقىت كېتىشى مۇمكىن.

source: This extension could not be downloaded because of a connection failure.
ug: بۇ كېڭەيتىلمىنى چۈشۈرەلمەيدۇ چۈنكى باغلىنالمىدى.

source: This extension could not be installed because it appears to be corrupt.
ug: بۇ كېڭەيتىلمىنى ئورنىتالمايدۇ چۈنكى ئۇ بۇزۇلغاندەك قىلىدۇ.

source: This extension could not be installed because it has not been verified.
ug: بۇ كېڭەيتىلمىنى ئورنىتالمايدۇ چۈنكى ئۇنى دەلىللىيەلمىدى.

source: This extension doesn’t require any permissions.
ug: بۇ كېڭەيتىلمە ھېچقانداق ئىجازەت تەلەپ قىلمايدۇ.

source: This extension is blocked for violating Mozilla’s policies and has been disabled.
ug: بۇ كېڭەيتىلمە Mozilla نىڭ تۈزۈمىگە خىلاپ بولغانلىقتىن توسۇلغان ۋە چەكلەنگەن.

source: This extension is restricted for violating Mozilla’s policies and has been disabled. You can enable it, but this may be risky.
ug: بۇ كېڭەيتىلمە Mozilla نىڭ تۈزۈمىگە خىلاپلىق قىلغانلىقتىن چەكلەنگەن. ئۇنى قوزغىتالايسىز ئەمما بۇ خەتەرلىك بولۇشى مۇمكىن.

source: This extension violates Mozilla’s policies and has been disabled. You can enable it, but this may be risky.
ug: بۇ كېڭەيتىلمە Mozilla نىڭ تۈزۈمىگە خىلاپلىق قىلغانلىقتىن چەكلەنگەن. ئۇنى قوزغىتالايسىز ئەمما بۇ خەتەرلىك بولۇشى مۇمكىن.

source: This extension violates Mozilla’s policies. Using it may be risky.
ug: بۇ كېڭەيتىلمە Mozilla نىڭ تۈزۈمىگە خىلاپلىق قىلىدۇ. ئۇنى ئىشلىتىش خەتەرلىك بولۇشى مۇمكىن.

source: This is sample text. It is here to show how text will appear when you increase or decrease the size with this setting.
ug: بۇ ئۈلگە تېكىست. بۇ تەڭشەك بىلەن تېكىستنى چوڭايتقاندا ياكى كىچىكلەتكەندە تېكىستنىڭ قانداق كۆرۈلىدىغانلىقىنى كۆرسىتىپ بېرىدۇ.

source: This time search in:
ug: بۇ قېتىمقى ئىزدەش:

source: This website requires a secure connection.
ug: بۇ تور بېكەت بىخەتەر ئۇلىنىشنى تەلەپ قىلىدۇ.

source: Thought-provoking stories
ug: نادىر ھېكايە

source: Time range to delete
ug: ئۆچۈرىدىغان ۋاقىت دائىرىسى

source: To add a new shortcut, remove one. Touch and hold the site and select remove.
ug: يېڭى تىزلەتمە قوشۇش ئۈچۈن بىرنى چىقىرىۋېتىش كېرەك. بېكەتنى چېكىپ تۇرۇپ ئاندىن چىقىرىۋەت تاللىنىدۇ.

source: To add a new site: Visit it and select “Never translate this site” from the translation menu.
ug: يېڭى تور بېكەت قوشۇش: تور بېكەتنى زىيارەت قىلىپ تەرجىمە تىزىملىكىدىن «بۇ تور بېكەتنى ھەرگىز تەرجىمە قىلما» تاللىنىدۇ.

source: To allow it:
ug: يول قويىدۇ:

source: Today and yesterday
ug: بۈگۈن ۋە تۈنۈگۈن

source: To exit fullscreen, drag from top and press back
ug: پۈتۈن ئېكران ھالىتىدىن چېكىنىشتە، چوققىسىدىن سۆرەپ، قايت چېكىلىدۇ

source: To exit fullscreen, drag from top and use back gesture
ug: پۈتۈن ئېكران ھالىتىدىن چېكىنىشتە، چوققىسىدىن سۆرەپ، قايت قول ئىشارىتى ئىشلىتىلىدۇ

source: To know whether this product’s reviews are reliable, check the review quality. It only takes about 60 seconds.
ug: بۇ مەھسۇلاتنىڭ باھالىنىشىنىڭ ئىشەنچلىك ياكى ئەمەسلىكىنى بىلىش ئۈچۈن، باھالىنىش سۈپىتىنى تەكشۈرۈڭ. بۇنىڭغا پەقەت 60 سېكۇنتلا ۋاقىت كېتىدۇ.

source: Toolbar
ug: قورال بالداق

source: Tools
ug: قوراللار

source: Top
ug: چوققا

source: To send a tab, sign in to Firefox on at least one other device.
ug: ئاز دېگەندە بىر ئۈسكۈنىدە Firefox تىزىمغا كىرگەندە ئاندىن بەتكۈچ يوللىيالايدۇ.

source: Total Cookie Protection isolates cookies to the site you’re on so trackers like ad networks can’t use them to follow you across sites.
ug: ئومۇمىيەت ساقلانما قوغداش ئىقتىدارى ھەر بىر تور بېكەتنىڭ ساقلانمىسىنى ئايرىۋېتىپ، ئېلان تورلىرىنىڭ تور بېكەت ھالقىپ بۇ خىل ئىزلىغۇچلارنى ئىشلىتىپ ئەگىشىشىنى چەكلەيدۇ.

source: To use extensions, enable them in settings or by selecting “%s” below.
ug: كېڭەيتىلمە ئىشلىتىشتە تەڭشەكتىن قوزغىتىلىدۇ ياكى تۆۋەندىكى «%s» تاللىنىدۇ.

source: Tracking content
ug: ئىز قوغلاش مەزمۇنى

source: Tracking Content
ug: ئىز قوغلاش مەزمۇنى

source: Tracking Protection has blocked trackers
ug: ئىز قوغلاش قوغدىغۇچىسى ئىز قوغلىغۇچىلارنى توستى

source: Tracking Protection is off for this site
ug: بۇ توربېكەتكە نىسبەتەن ئىزلاش ئېتىلگەن

source: Tracking Protection is on
ug: ئىزلاشتىن توسۇش ئىقتىدارى ئوچۇق

source: Translate
ug: تەرجىمە

source: Translated to %1$s
ug: %1$s غا تەرجىمە قىلىندى

source: Translate from
ug: مەنبە تىل

source: Translate page
ug: بەت تەرجىمىسى

source: Translate page…
ug: بەت تەرجىمىسى…

source: Translate this page?
ug: بۇ بەتنى تەرجىمە قىلامدۇ؟

source: Translate to
ug: نىشان تىل

source: Translating
ug: تەرجىمە قىلىۋاتىدۇ

source: Translating…
ug: تەرجىمە قىلىۋاتىدۇ…

source: Translating in Progress
ug: تەرجىمە قىلىنىۋاتىدۇ

source: Translation
ug: تەرجىمە

source: Translation not found, for locale %1$s neither default language %2$s
ug: يەرلىك تىل %1$s ياكى كۆڭۈلدىكى تىل %2$s نىڭ تەرجىمە ئۇچۇرلىرى تېپىلمىدى

source: Translation options
ug: تەرجىمە تاللانمىسى

source: Translation Options
ug: تەرجىمە تاللانمىلىرى

source: Translation preferences
ug: تەرجىمە مايىللىقى

source: Translations
ug: تەرجىمە

source: Translation settings
ug: تەرجىمە تەڭشەكلىرى

source: Try again
ug: قايتا سىنا

source: Try Again
ug: قايتا سىناڭ

source: Try another source language
ug: باشقا مەنبە تىلنى سىنا

source: Try a splash of color
ug: يېڭى رەڭ سىناڭ

source: Try connecting on a different device. Check your modem or router. Disconnect and reconnect to Wi-Fi.
ug: باشقا ئۈسكۈنىگە باغلاپ سىناپ بېقىڭ. مودېمىڭىز ياكى يېتەكلىگۈچىڭىزنى تەكشۈرۈڭ. باغلىنىشنى ئۈزۈپ ئاندىن سىمسىز تور يەنى Wi-Fi غا قايتا باغلاڭ.

source: Try our trusted guide to product reviews
ug: مەھسۇلات باھالىنىشغا قارىتا ئىشەنچلىك يېتەكچىمىزنى سىناپ بېقىڭ

source: Try private browsing
ug: شەخسىي زىيارەتنى سىناڭ

source: Try private translations in %1$s
ug: %1$s دىكى شەخسىي تەرجىمىلەرنى سىناپ بېقىڭ

source: Try restarting add-ons
ug: قوشۇلمىنى قايتا قوزغىتىپ بېقىڭ

source: Try restarting extensions
ug: كېڭەيتىلمىنى قايتا قوزغىتىشنى سىناۋاتىدۇ

source: Try review checker
ug: باھالاش تەكشۈرگۈچنى سىناي

source: Try the Firefox search widget
ug: Firefox ئىزدەش ئەپچەنى سىناڭ

source: Turn off and %1$s will clear cookies and reload this site. This may sign you out or empty shopping carts.
ug: تاقالسا ۋە %1$s ساقلانمىنى تازىلاپ بۇ تور بېكەتنى قايتا يۈكلەيدۇ. سىز تىزىمدىن چىقىپ كېتىشىڭىز ياكى مال ھارۋىسى بوشىتىلىشى مۇمكىن.

source: Turn off Cookie Banner Blocker for %1$s?
ug: %1$s غا cookie لوزۇنكىسى توسقۇچنى تاقامدۇ؟

source: Turn off Cookie banner reduction for %1$s?
ug: %1$s غا cookie لوزۇنكىسى ئازايتىشنى تاقامدۇ؟

source: Turn off in settings
ug: تەڭشەكلەردىن تاقايدۇ

source: Turn off Reader View
ug: ئوقۇرمەن كۆرۈنۈشىنى تاقا

source: Turn off review checker
ug: باھالاش تەكشۈرگۈچنى تاقا

source: Turn on and %1$s will try to automatically refuse all cookie banners on this site.
ug: ئېچىلسا، %1$s بۇ تور بېكەتتىكى بارلىق ساقلانما لوزۇنكىسىنى ئۆزلۈكىدىن رەت قىلىشنى سىنايدۇ.

source: Turn on auto-close
ug: ئاپتوماتىك ياپنى ئاچ

source: TURN ON AUTO CLOSE
ug: ئاپتوماتىك تاقاشنى ئاچىدۇ

source: Turn on Cookie Banner Blocker for %1$s?
ug: %1$s غا cookie لوزۇنكىسى توسقۇچنى ئاچامدۇ؟

source: Turn on Cookie banner reduction for %1$s?
ug: %1$s غا cookie لوزۇنكىسى ئازايتىشنى ئاچامدۇ؟

source: Turn on for all sites
ug: ھەممە تور بېكەتكە ئوچۇق

source: Turn on notifications
ug: ئۇقتۇرۇشنى ئاچ

source: Turn on Reader View
ug: ئوقۇرمەن كۆرۈنۈشىنى ئاچ

source: <ul> <li>Could the item have been renamed, removed, or relocated?</li> <li>Is there a spelling, capitalization, or other typographical error in the address?</li> <li>Do you have sufficient access permissions to the requested item?</li> </ul>
ug: <ul> <li> بۇ تۈر نامى ئۆزگەرتىلگەن، ئۆچۈرۈلگەن ياكى كۆچۈرۈلگەنمۇ؟ </li> <li> ئادرېسنىڭ ئىملاسىدا ياكى چوڭ-كىچىك يېزىلىشى ياكى باشقا يېزىق خاتالىقى بارمۇ؟ </li> <li> تەلەپ قىلىنغان تۈرنى زىيارەت قىلىش ئۈچۈن يېتەرلىك ھوقۇقىڭىز بارمۇ؟ </li> </ul>

source: <ul> <li>It may have been removed, moved, or file permissions may be preventing access.</li> </ul>
ug: <ul> <li>ھۆججەت يۇيۇلغان ياكى يۆتكەلگەن ۋە ياكى زىيارەت ھوقۇقى يوق بولۇشى مۇمكىن</li> </ul>

source: <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
ug: <ul> <li>توربېكەت ئىگىلىرى بىلەن ئالاقىلىشىپ ، ئۇلارغا بۇ مەسىلىنى ئۇقتۇرۇڭ.</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.</li> <li>Please contact the website owners to inform them of this problem.</li> </ul>
ug: <ul> <li>سىز كۆرمەكچى بولغان بەتنى كۆرسەتكىلى بولمايدۇ ، چۈنكى تاپشۇرۇۋالغان سانلىق مەلۇماتلارنىڭ راست-يالغانلىقىنى تەكشۈرگىلى بولمايدۇ.</li> <li>توربېكەت ئىگىلىرى بىلەن ئالاقىلىشىپ ، ئۇلارغا بۇ مەسىلىنى ئۇقتۇرۇڭ.</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because this website requires a secure connection.</li> <li>The issue is most likely with the website, and there is nothing you can do to resolve it.</li> <li>You can notify the website’s administrator about the problem.</li> </ul>
ug: <ul> <li>سىز زىيارەت قىلماقچى بولغان بەتنى كۆرسەتكىلى بولمايدۇ، چۈنكى بۇ تور بېكەت بىخەتەر ئۇلىنىشنى تەلەپ قىلىدۇ.</li> <li>مەسىلە تور بېكەتتە بولۇشى مۇمكىن، ئۇنى سىز ھەل قىلالمايسىز.</li> <li>مەسىلىنى تور بېكەت باشقۇرغۇچىسىغا ئۇقتۇرۇپ قويالايسىز.</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
ug: <ul> <li>تور بېكەتنى ۋاقتىنچە ئىشلەتكىلى بولمايدۇ ياكى مۇلازىمىتىر ئالدىراش بولۇشى مۇمكىن. سەل تۇرۇپ قايتا سىناڭ.</li> <li>ئەگەر ھېچقانداق بەتنى يۈكلىيەلمىسىڭىز، ئۈسكۈنىڭىزنىڭ سانلىق مەلۇمات تورى ياكى Wi-Fi ئۇلىنىشىنى تەكشۈرۈڭ.</li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
ug: <ul> <li>بۇ مۇلازىمىتىرنىڭ سەپلىمىسىدە مەسىلە بولغانلىقى، ياكى نامەلۈم كىشلەرنىڭ مۇلازىمىتىرنى دوراشقا ئۇرۇنغانلىق سەۋەبلىك بولۇشى مۇمكىن.</li> <li>ئەگەر سىز بۇرۇن بۇ مۇلازىمېتىرغا مۇۋەپپەقىيەتلىك ئۇلىنالىغان بولسىڭىز، خاتالىق ۋاقىتلىق بولۇشى مۇمكىن، شۇنداقلا قايتا سىناپ باقسىڭىز بولىدۇ.</li> </ul>

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
ug: <ul> <li>تور ئادرېسى ئادەتتە مىسالدىكىدەك يېزىلىدۇ، مىسال- <strong>http://www.example.com/</strong></li> <li>ئىشلەتكىنىڭىزنىڭ يانتۇ سېزىق ئىكەنلىكىنى جەزىملەشتۈرۈڭ.(مىسال. <strong>/</strong>).</li> </ul>

source: Unable to connect
ug: ئۇلىنالمىدى

source: Unable to generate PDF
ug: PDF ھاسىل قىلالمىدى

source: Unable to open %1$s
ug: %1$sنى ئاچالمىدى

source: Unable to print
ug: باسالمىدى

source: Unable to print this page
ug: بۇ بەتنى باسالمايدۇ

source: Unable to save login
ug: كىرىش ئۇچۇرىنى ساقلىيالمايدۇ

source: Unable to send
ug: يوللىيالمىدى

source: UNDO
ug: يېنىۋال

source: Unexpected response from server
ug: كۈتۈلمىگەن مۇلازىمېتىر ئىنكاسى

source: Unfortunately, we can’t check the review quality for certain types of products. For example, gift cards and streaming video, music, and games.
ug: ئەپسۇسلىنارلىقى، بىز بەزى تۈردىكى مەھسۇلاتلارنىڭ باھالىنىش سۈپىتىنى تەكشۈرەلمەيمىز. مەسىلەن، سوۋغات كارتىسى ۋە ئاقما سىن، مۇزىكا ۋە ئويۇنلار.

source: Unknown Protocol
ug: نامەلۇم كېلىشىم

source: Unlock %1$s
ug: %1$s قۇلۇپىنى ئاچ

source: Unlock to use saved payment methods
ug: ساقلانغان چىقىم قىلىش ئۇسۇلىنى ئىشلىتىش ئۈچۈن قۇلۇپ ئېچىڭ

source: Unlock to use stored credit card information
ug: ساقلانغان ئىناۋەتلىك كارتا ئۇچۇرلىرىنى ئىشلىتىش ئۈچۈن قۇلۇپ ئېچىڭ

source: Unlock to view your saved cards
ug: ساقلانغان كارتىلىرىڭىزنى كۆرۈش ئۈچۈن قۇلۇپ ئېچىڭ

source: Unlock to view your saved logins
ug: ساقلانغان كىرىشلىرىڭىزنى كۆرۈش ئۈچۈن قۇلۇپ ئېچىڭ

source: Unlock to view your saved passwords
ug: ساقلانغان پارولىڭىزنى كۆرۈش ئۈچۈن قۇلۇپ ئېچىڭ

source: Unlock your device
ug: ئۈسكۈنىڭىزنىڭ قۇلۇپىنى ئېچىڭ

source: Unreliable reviews
ug: ئىشەنچسىز باھالاش

source: Unreliable reviews removed
ug: ئىشەنچسىز باھا چىقىرىۋېتىلدى

source: Unreliable reviews. We believe the reviews are likely fake or from biased reviewers.
ug: ئىشەنچسىز باھالاش. بىز بۇنى ساختا ياكى بىر تەرەپلىمە باھالىغۇچىلار باھالىغان بولۇشى مۇمكىن دەپ قارايمىز.

source: Unsafe File Type
ug: خەتەرلىك ھۆججەت تىپى

source: Unwanted site issue
ug: كېرەكسىز بېكەت مەسىلىسى

source: Update
ug: يېڭىلاش

source: Update card expiration date?
ug: كارتىنىڭ مۇددىتى توشۇش قەرەلىنى يېڭىلامدۇ؟

source: Update password?
ug: ئىم يېڭىلامدۇ؟

source: Updater Information
ug: يېڭىلاش ئۇچۇرى

source: Update this login?
ug: بۇ كىرىشنى يېڭىلامدۇ؟

source: Update username?
ug: ئىشلەتكۈچى ئاتىنى يېڭىلامدۇ؟

source: URL
ug: تور ئادرېسى

source: URL copied
ug: تور ئادرېسى كۆچۈرۈلدى

source: URL copied.
ug: URL كۆچۈرۈلدى.

source: URL copied to clipboard
ug: تور ئادرېسى چاپلاش تاختىسىغا كۆچۈرۈلدى

source: URL to use for search
ug: ئىزدەشكە ئىشلىتىدىغان تور ئادرېسى

source: Usage and technical data
ug: ئىشلىتىلىشى ۋە تېخنىكىلىق سانلىق مەلۇمات

source: Use %1$s as a login provider
ug: تىزىمغا كىرىشنى تەمىنلىگۈچىگە %1$s نى ئىشلىتىدۇ

source: Use email instead
ug: ئورنىغا ئېلخەت ئىشلىتىڭ

source: Use password
ug: ئىم ئىشلىتىش

source: Username
ug: ئىشلەتكۈچى

source: Username copied to clipboard
ug: ئىشلەتكۈچى ئىسمى چاپلاش تاختىسىغا كۆچۈرۈلدى

source: Username required
ug: ئىشلەتكۈچى ئىسمى زۆرۈر

source: Username updated
ug: ئىشلەتكۈچى ئاتى يېڭىلاندى

source: Use saved card
ug: ساقلانغان كارتىنى ئىشلەت

source: Use strong password
ug: كۈچلۈك ئىم ئىشلىتىش

source: Use strong password?
ug: كۈچلۈك ئىم ئىشلىتەمدۇ؟

source: Use strong password: %1$s
ug: كۈچلۈك ئىم ئىشلىتىش: %1$s

source: Using the power of %1$s by Mozilla, we help you avoid biased and inauthentic reviews. Our AI model is always improving to protect you as you shop. %2$s
ug: Mozilla قوللايدىغان %1$s بىر تەرەپلىمە ۋە ئىناۋەتسىز باھالاشلاردىن ساقلىنىشىڭىزغا ياردەم بېرىدۇ. بىزنىڭ سۈنئىي ئەقىل مودېلىمىز مال سېتىۋېلىشىڭىزنى قوغداش ئۈچۈن ھەمىشە ياخشىلىنىۋاتىدۇ. %2$s

source: Valid hostname required
ug: ئىناۋەتلىك مۇلازىم ئىسمى زۆرۈر

source: Verification failed
ug: دەلىللىيەلمىدى

source: Verified By: %1$s
ug: دەلىللىگۈچى: %1$s

source: Very Dissatisfied
ug: بەك نارازى

source: Very Satisfied
ug: بەك رازى

source: View
ug: كۆرۈنۈش

source: View a list of tabs from your other devices.
ug: باشقا ئۈسكۈنىڭىزدىن بەتكۈچ تىزىمىنى كۆرسىتىدۇ.

source: View options
ug: كۆرۈنۈش تاللانمىلار

source: View recently closed tabs
ug: يېقىندا تاقالغان بەتكۈچلەرنى كۆرسەت

source: Voice search
ug: ئاۋازلىق ئىزدەش

source: Wallpaper Item: %1$s
ug: تام قەغىزى تۈرى: %1$s

source: Wallpapers
ug: تام قەغىزى

source: Wallpaper updated!
ug: تام قەغىزى يېڭىلاندى!

source: We assign each product’s reviews a <b>letter grade</b> from A to F.
ug: بىز ھەر بىر مەھسۇلاتنىڭ باھالىنىشىغا A دىن F غىچە <b>ھەرپ دەرىجىسى</b> تەقسىملەيمىز.

source: Web address must contain "https://" or "http://"
ug: تور ئادرېسىدا چوقۇم «https://» ياكى «http://» بولۇشى كېرەك.

source: Web address not valid.
ug: تور ئادرېس ئىناۋەتسىز.

source: We believe there’s a mix of reliable and unreliable reviews.
ug: ئىشەنچلىك ۋە ئىشەنچسىز باھالارنىڭ بارلىقىغا ئىشىنىمىز.

source: We believe the reviews are unreliable.
ug: بىز باھالارنىڭ ئىشەنچلىك ئەمەسلىكىگە ئىشىنىمىز.

source: We believe the reviews to be reliable.
ug: باھالارنىڭ ئىشەنچلىك ئىكەنلىكىگە ئىشىنىمىز.

source: Website
ug: تور بېكەت

source: We can’t auto refuse cookie pop-ups on this site right now.
ug: ھازىرچە بۇ تور بېكەتتىكى ساقلانمىنىڭ قاڭقىش كۆزنىكىنى رەت قىلالمايدۇ.

source: We can’t check these reviews
ug: بۇ باھالاشلارنى تەكشۈرەلمەيمىز

source: We download partial languages to keep translations private.
ug: تەرجىمىنىڭ شەخسىيىتىنى قوغداش ئۈچۈن تىلدىن قىسمەن چۈشۈردۇق.

source: We download partial languages to your cache to keep translations private.
ug: تەرجىمىنىڭ شەخسىيىتىنى قوغداش ئۈچۈن، تىل قىسمەن ھالدا غەملىكىڭىزگە چۈشۈرۈلىدۇ.

source: Welcome to a more personal internet
ug: تېخىمۇ خاسلاشتۇرۇلغان ئىنتېرنېتقا خۇش كەلدىڭىز

source: Welcome to %s!
ug: %sگە خۇش كەپسىز!

source: We love keeping you safe
ug: بىخەتەرلىكىڭىزنى ساقلاشنى ياخشى كۆرىمىز

source: We‘re currently building support for an initial selection of Recommended Extensions.
ug: بىز ھازىر تەۋسىيە قىلىنغان كېڭەيتىلمىلەرنىڭ دەسلەپكى تاللىشىنى قوللاشقا تىرىشىۋاتىمىز.

source: We’re working to resolve the issue. Please check back soon.
ug: بىز بۇ مەسىلىنى ھەل قىلىش ئۈچۈن تىرىشىۋاتىمىز. پات پۇرسەتتە قايتا تەكشۈرۈپ بېقىڭ.

source: We should have info about this product’s reviews within 24 hours. Please check back.
ug: بىز 24 سائەت ئىچىدە بۇ مەھسۇلاتنىڭ باھالىنىشىغا مۇناسىۋەتلىك ئۇچۇرىغا ئېرىشىمىز. قايتا كېلىپ تەكشۈرۈپ بېقىڭ.

source: We use AI technology from %s by Mozilla to check the reliability of product reviews. This will only help you assess review quality, not product quality.
ug: بىز Mozilla نىڭ %s دىكى سۈنئىي ئەقىل تېخنىكىسىنى ئىشلىتىپ مەھسۇلات باھالىنىشىنىڭ ئىشەنچلىكلىكىنى تەكشۈردۇق. بۇ مەھسۇلات سۈپىتىنى ئەمەس، بەلكى باھالاش سۈپىتىنى باھالىشىڭىزغا ياردەم بېرىدۇ.

source: What’s blocked by custom tracking protection
ug: ئىختىيارىچە ئىز قوغلاشتىن قوغداشتا نېمىلەر توسۇلىدۇ

source: What’s blocked by standard tracking protection
ug: ئۆلچەملىك ئىز قوغلاشتىن قوغداشتا نېمىلەر توسۇلىدۇ

source: What’s blocked by strict tracking protection
ug: ئىز قوغلاشتىن قاتتىق قوغداشتا نېمىلەر توسۇلىدۇ

source: What’s broken? (optional)
ug: نېمە بۇزۇلدى؟ (تاللاشچان)

source: What’s new
ug: نېمە يېڭىلىق بار

source: What’s new in %s
ug: %s دىكى يېڭىلىقلار

source: When this product has more reviews, we’ll be able to check their quality.
ug: بۇ مەھسۇلاتنىڭ باھالىنىشى تېخىمۇ كۆپ بولغاندا، بىز ئۇلارنىڭ سۈپىتىنى تەكشۈرەلەيمىز.
